#!/bin/bash
#--------------------------------------------------------------------------------------------------------------------------------
# LoadAverage + iostat
#--------------------------------------------------------------------------------------------------------------------------------
# Количество процессоров (ядер), с учетом "hyper threading"
p=$(cat /proc/cpuinfo | grep -i 'core id' | wc -l)
#--------------------------------------------------------------------------------------------------------------------------------
# Вытягиваем данные из аптайма
# cat /proc/loadavg | awk -F " " '{print " Load Average: "$1" "$2" "$3}'
#--------------------------------------------------------------------------------------------------------------------------------
# Прогрессивно вытягиваем данные из аптайма
uptime | awk -v LIM1=0.5 -vLIM2=0.9 -v PROCC=$p -F " " '{ print "<table border=\"1\"><tr><td>";                                 \
															print $1" "$2" "$3" "$4" "$5" "$6" "$7" "$8"</td>";                 \
															na = substr($9, 1, length($9)-1);                                   \
					                                 		nb = substr($10, 1, length($10)-1);                                 \
					                                 		nc = $11;                                                           \
					                                 		{ if (na/PROCC > LIM1)                                              \
					                                 		  { if (na/PROCC > LIM2) print "<td style=\"color: red;\">";        \
					                                 		    else print "<td style=\"color: orange;\">"; }                   \
					                                 		  else print "<td style=\"color: green;\">"; }                      \
					                                 		print na"</td>";                                                    \
					                                 		{ if (nb/PROCC > LIM1)                                              \
					                                 		  { if (nb/PROCC > LIM2) print "<td style=\"color: red;\">";        \
					                                 		    else print "<td style=\"color: orange;\">"; }                   \
					                                 		  else print "<td style=\"color: green;\">"; }                      \
					                                 		print nb"</td>";                                                    \
					                                 		{ if (nc/PROCC > LIM1)                                              \
					                                 		  { if (nc/PROCC > LIM2) print "<td style=\"color: red;\">";        \
					                                 		    else print "<td style=\"color: orange;\">"; }                   \
					                                 		  else print "<td style=\"color: green;\">"; }                      \
					                                 		print nc"</td></tr></table>";}'
#--------------------------------------------------------------------------------------------------------------------------------
#iostat
#--------------------------------------------------------------------------------------------------------------------------------
